Tekla Open API Reference for Tekla Structures 2025
OBB.ClosestPointTo Method
Overload List
Name | Description
ClosestPointTo(Line)
 Calculates the closest point in OBB to given Line.
ClosestPointTo(LineSegment)
 Calculates the closest point in OBB to given LineSegment.
ClosestPointTo(Point)
 Calculates the closest point in OBB to given point.
Top
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace